# AddReferencePlane Method (Plane) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DirectShapeType..::..AddReferencePlane Method (Plane)
DirectShapeType Class See Also
---
Adds a reference plane to the DirectShapeType. The reference plane can either be bounded or unbounded.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public void AddReferencePlane(
	Plane refPlane
)
```

Visual Basic
---
```text
Public Sub AddReferencePlane ( _
	refPlane As Plane _
)
```

Visual C++
---
```text
public:
void AddReferencePlane(
	Plane^ refPlane
)
```

# ### Parameters
refPlane
    Type: Autodesk.Revit.DB..::..Plane The geometry of the new reference plane.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DirectShapeType Class
AddReferencePlane Overload
Autodesk.Revit.DB Namespace